load-test.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 2
      rampTo: 10
      name: Ramp up
    - duration: 60
      arrivalRate: 10
      name: Sustained load (Peak 100+ concurrent)
  defaults:
    headers:
      User-Agent: "Artillery-Load-Test"

scenarios:
  - name: "Browsing Flow"
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/products"
      - think: 1
      - get:
          url: "/blog"
      - think: 1
      - get:
          url: "/manufacturing"
      - think: 1
      - get:
          url: "/about"
      - think: 1
      - get:
          url: "/contact"